<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
	<string>com.github.cgerke.DisableDockfixup</string>
	<key>Description</key>
	<string>Create a cmmac package. Create a payload free package. Disable Apple Dockfixup changes by moving the plist. This file is responsible
for adding default items to the dock during a new home directory creation. It also changes the dock items after an
upgrade if Apple have changed the name of an item.</string>
	<key>Identifier</key>
	<string>com.github.cgerke.sccm.DisableDockfixup</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DisableDockfixup</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Create a cmmac file for SCCM using a shared processor.</string>
			<key>Processor</key>
			<string>com.github.cgerke.cgerke-recipes.SharedProcessorCmmacCreator/CmmacCreator</string>
			<key>Arguments</key>
			<dict>
				<key>source_file</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>destination_directory</key>
				<string>%RECIPE_CACHE_DIR%</string>
			</dict>
			<key>SharedProcessorRepoURL</key>
			<string>https://github.com/cgerke/cgerke-recipes</string>
		</dict>
	</array>
</dict>
</plist>
