<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
	<string>com.github.cgerke.DisableSetupAssistant</string>
	<key>Description</key>
	<string>Create a cmmac package. Disable Apple Setup Assistant. This is primarily used to avoid end users having to a
local system account the first time the system boots. Typically you would use this pkg in conjunction
with https://github.com/MagerValp/CreateUserPkg or another script to create any local users required
in your environment.</string>
	<key>Identifier</key>
	<string>com.github.cgerke.sccm.DisableSetupAssistant</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DisableSetupAssistant</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Create a cmmac file for SCCM.</string>
			<key>Processor</key>
			<string>cmmacCreator</string>
			<key>Arguments</key>
			<dict>
				<key>source_file</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>destination_directory</key>
				<string>%RECIPE_CACHE_DIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
