<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Create a package. Firstboot script example. This script sets the hostname etc to match the ethernet Mac
address (without the colons). This type of script is very subjective so it serves as an example at the moment.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.cgerke-recipes.Firstboot</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Firstboot</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Create a root.</string>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>pkgdirs</key>
				<dict>
					<key>usr</key>
					<string>0755</string>
					<key>usr/local</key>
					<string>0755</string>
					<key>usr/local/bin</key>
					<string>0755</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Copy firstboot.sh to /usr/local/bin/firstboot.sh</string>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_DIR%/%NAME%/Root/usr/local/bin/firstboot.sh</string>
				<key>destination_path</key>
				<string>%pkgroot%/usr/local/bin/firstboot.sh</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Create a PackageInfo file using the template.</string>
			<key>Processor</key>
			<string>PkgInfoCreator</string>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>0.1</string>
				<key>template_path</key>
				<string>%RECIPE_DIR%/%NAME%/PackageInfo</string>
				<key>infofile</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
				<key>pkgtype</key>
				<string>flat</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Build the package.</string>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgname</key>
				<string>%NAME%</string>
				<key>pkg_request</key>
				<dict>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>id</key>
					<string>com.github.autopkg.cgerke-recipes.%NAME%</string>
					<key>infofile</key>
					<string>%RECIPE_DIR%/%NAME%/PackageInfo</string>
					<key>resources</key>
					<string>%RECIPE_DIR%/%NAME%/Resources</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>scripts</key>
					<string>%RECIPE_DIR%/%NAME%/Scripts</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>usr</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
						<dict>
							<key>path</key>
							<string>usr/local</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
						<dict>
							<key>path</key>
							<string>usr/local/bin</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
