<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Create a package.</string>
	<key>Identifier</key>
	<string>com.github.cgerke.Firstboot</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Firstboot</string>
		<key>URL</key>
		<string>https://github.com/cgerke/autopkg-template/zipball/master</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Download git repo.</string>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%URL%</string>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/source</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%destination_path%</string>
			</dict>
			<key>Processor</key>
			<string>ThinImageModulesSourceFinder</string>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Create a root.</string>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%_root</string>
				<key>pkgdirs</key>
				<dict>
					<key>private</key>
          <string>0755</string>
          <key>private/var</key>
          <string>0755</string>
          <key>private/var/db</key>
          <string>0755</string>
				</dict>
			</dict>
		</dict>
		<dict>
      <key>Comment</key>
      <string>Copy firstboot.sh to /usr/local/bin/firstboot.sh</string>
      <key>Processor</key>
      <string>Copier</string>
      <key>Arguments</key>
      <dict>
          <key>source_path</key>
          <string>%pkg_path%/%NAME%/Root/usr/local/bin/firstboot.sh</string>
          <key>destination_path</key>
          <string>%pkgroot%/usr/local/bin/firstboot.sh</string>
      </dict>
    </dict>
		<dict>
			<key>Comment</key>
			<string>Create a PackageInfo file using the template.</string>
			<key>Processor</key>
			<string>PkgInfoCreator</string>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>0.1</string>
				<key>template_path</key>
				<string>%pkg_path%/%NAME%/PackageInfo</string>
				<key>infofile</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
				<key>pkgtype</key>
				<string>flat</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Build the package.</string>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgname</key>
				<string>%NAME%</string>
				<key>pkg_request</key>
				<dict>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>id</key>
					<string>com.github.cgerke.%NAME%</string>
					<key>infofile</key>
					<string>%pkg_path%/%NAME%/PackageInfo</string>
					<key>resources</key>
					<string>%pkg_path%/%NAME%/Resources</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>scripts</key>
					<string>%pkg_path%/%NAME%/Scripts</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>usr</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
						<dict>
							<key>path</key>
							<string>usr/local</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
						<dict>
							<key>path</key>
							<string>usr/local/bin</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
