<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.AdobeReaderDC</string>
	<key>Description</key>
	<string>Downloads the latest Adobe Reader DC version and creates a cmmac package for deploying via Microsoft SCCM.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.cgerke-recipes.sccm.AdobeReaderDC</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeReaderDC</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
				<key>source_pkg</key>
                <string>%pathname%/*.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
            </dict>
        </dict>
		<dict>
			<key>Comment</key>
			<string>Create a cmmac file for SCCM using a shared processor.</string>
			<key>Processor</key>
			<string>com.github.autopkg.cgerke-recipes.SharedProcessors/CmmacCreator</string>
			<key>Arguments</key>
			<dict>
				<key>source_file</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>destination_directory</key>
				<string>%RECIPE_CACHE_DIR%</string>
			</dict>
			<key>SharedProcessorRepoURL</key>
			<string>https://github.com/autopkg/cgerke-recipes</string>
		</dict>
	</array>
</dict>
</plist>
