<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist
  PUBLIC '-//Apple//DTD PLIST 1.0//EN'
  'http://www.apple.com/DTDs/PropertyList-1.0.dtd'>
<plist version="1.0">
    <dict>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.cgerke-recipes.download.AmazonEC2Tools</string>
        <key>Description</key>
        <string>Create a pkg to deply AmazonEC2Tools, this pkg isn't configure to setup your HOME environment
      or ACCESS KEYS, refer to Amazon documentation. http://docs.aws.amazon.com/AWSEC2/latest/CommandLineReference/set-up-ec2-cli-linux.html</string>
        <key>Identifier</key>
        <string>com.github.autopkg.cgerke-recipes.pkg.AmazonEC2Tools</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AmazonEC2Tools</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.9</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Comment</key>
                <string>Downloads the latest version of Amazon EC2 Tools and creates a package for deployment.</string>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>usr</key>
                        <string>0755</string>
                        <key>usr/local</key>
                        <string>0755</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Comment</key>
                <string>Copy bin to /usr/local/ec2</string>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%destination_path%/*/</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/usr/local/ec2</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileFinder</string>
                <key>Arguments</key>
                <dict>
                    <key>pattern</key>
                    <string>%RECIPE_CACHE_DIR%/source/ec2-api-tools-*</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>find</key>
                    <string>%RECIPE_CACHE_DIR%/source/ec2-api-tools-</string>
                    <key>input_string</key>
                    <string>%found_filename%</string>
                    <key>replace</key>
                    <string/>
                </dict>
                <key>Processor</key>
                <string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
            </dict>
            <dict>
                <key>Comment</key>
                <string>Create a PackageInfo file using the template.</string>
                <key>Processor</key>
                <string>PkgInfoCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>version</key>
                    <string>%output_string%</string>
                    <key>template_path</key>
                    <string>%RECIPE_DIR%/%NAME%/PackageInfo</string>
                    <key>infofile</key>
                    <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                    <key>pkgtype</key>
                    <string>flat</string>
                </dict>
            </dict>
            <dict>
                <key>Comment</key>
                <string>Build the payload free package.</string>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgname</key>
                        <string>%NAME%-%version%</string>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>usr</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>usr/local</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>usr/local/ec2</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                            </dict>
                        </array>
                        <key>pkgdir</key>
                        <string>%RECIPE_CACHE_DIR%</string>
                        <key>id</key>
                        <string>com.github.cgerke.%NAME%</string>
                        <key>infofile</key>
                        <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                        <key>resources</key>
                        <string>%RECIPE_DIR%/%NAME%/Resources</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>scripts</key>
                        <string>%RECIPE_DIR%/%NAME%/Scripts</string>
                    </dict>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
