<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>ParentRecipe</key>
    <string>com.github.n8felton.download.AppleCanonLaserPrinterDrivers</string>
    <key>Description</key>
    <string>Downloads the latest (Apple) Canon Laser Printer Drivers version and extracts the package.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.cgerke-recipes.pkg.CanonLaserPrinterDrivers</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CanonLaserPrinterDrivers</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The cgerke-recipes repository is deprecated and will be removed soon.
Details: https://github.com/autopkg/cgerke-recipes/issues/37
                </string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
