<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
	<string>com.github.jaharmi.download.DeployStudio</string>
	<key>Description</key>
	<string>Downloads the latest version of DeployStudio and extracts a pkg.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.cgerke-recipes.pkg.DeployStudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DeployStudio</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
		    <key>Processor</key>
		    <string>PkgCopier</string>
		    <key>Arguments</key>
		    <dict>
			<key>source_pkg</key>
			<string>%pathname%/*.mpkg</string>
			<key>pkg_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%.mpkg</string>
		    </dict>
		</dict>
	</array>
</dict>
</plist>
