<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Google Drive disk image.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.cgerke-recipes.download.GoogleDrive</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoogleDrive</string>
        <key>DOWNLOAD_URL</key>
        <string>https://dl.google.com/drive/installgoogledrive.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The cgerke-recipes repository is deprecated.
Details: https://github.com/autopkg/cgerke-recipes/issues/37

Copies of these recipes have been created in the homebysix-recipes repo:
- GoogleDrive.download
- GoogleDrive.install
- GoogleDrive.pkg

These recipes are deprecated and will soon be removed:
- GoogleDrive.sccm

If you are interested in adopting the deprecated recipes, comment on
the issue linked above.
                </string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
