<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.cgerke-recipes.download.KonicaMinolta554e</string>
    <key>Description</key>
    <string>Downloads the Konica Minolta 554e Printer Drivers and builds a pkg.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.cgerke-recipes.pkg.KonicaMinolta554e</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KonicaMinolta554e</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
    	<dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_DIR%/Root</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Root</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
    	<dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/554e_Series_MacOS_v4-x-x.zip</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/</string>
                <key>purge_destination</key>
                <false/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/554e_Series__Mac_OS_v5-2-0_A4.zip</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/</string>
                <key>purge_destination</key>
                <false/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/bizhub_554e_109.pkg</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/Root/Library/ORG/Printers/KonicaMinolta/KonicaMinolta554e_10.9-10.10.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/Driver/OS_10_8_x/A4/bizhub_554e_108.pkg</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/Root/Library/ORG/Printers/KonicaMinolta/KonicaMinolta554e_10.8.pkg</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/Driver/OS_10_7_x/A4/bizhub_554e_107.pkg</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/Root/Library/ORG/Printers/KonicaMinolta/KonicaMinolta554e_10.7.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/Driver/OS_10_6_x/A4/bizhub_554e_106.pkg</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/Root/Library/ORG/Printers/KonicaMinolta/KonicaMinolta554e_10.6.pkg</string>
            </dict>
        </dict>
        <dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/Driver</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Create a PackageInfo file using the template.</string>
			<key>Processor</key>
			<string>PkgInfoCreator</string>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>5.2.0</string>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Root</string>
				<key>template_path</key>
				<string>%RECIPE_DIR%/PackageInfoTemplate</string>
				<key>infofile</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
				<key>pkgtype</key>
				<string>flat</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Build the payload free package.</string>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
                <key>force_pkg_build</key>
                <string>true</string>
				<key>pkgname</key>
				<string>%NAME%</string>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
					</array>
					<key>id</key>
					<string>com.github.autopkg.cgerke-recipes.%NAME%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>resources</key>
					<string>%RECIPE_DIR%/Resources</string>
					<key>scripts</key>
					<string>%RECIPE_DIR%/Scripts</string>
				</dict>
			</dict>
		</dict>
    </array>
</dict>
</plist>
