<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MySQLWorkbench.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.cgerke-recipes.download.MySQLWorkbench</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MySQLWorkbench</string>
                <key>USER_AGENT</key>
				<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_6) AppleWebKit/603.3.8 (KHTML, like Gecko) Version/10.1.2 Safari/603.3.8</string>
	</dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The cgerke-recipes repository is deprecated and will be removed soon.
Details: https://github.com/autopkg/cgerke-recipes/issues/37

Copies of these recipes have been created in the homebysix-recipes repo:
- MySQLWorkbench.download
- MySQLWorkbench.install
- MySQLWorkbench.munki
- MySQLWorkbench.pkg

These recipes are deprecated and will soon be removed:
- MySQLWorkbench.sccm

If you are interested in adopting the deprecated recipes, comment on
the issue linked above.
                </string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://dev.mysql.com/downloads/workbench</string>
                <key>re_pattern</key>
                <string>(?P&lt;dmg&gt;mysql-workbench-community-\S+dmg)</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://dev.mysql.com/get/Downloads/MySQLGUITools/%dmg%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
          <key>Arguments</key>
          <dict>
            <key>input_path</key>
            <string>%pathname%/MySQLWorkbench.app</string>
            <key>requirement</key>
            <string>identifier "com.oracle.workbench.MySQLWorkbench" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VB5E2TV963</string>
          </dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
