<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.cgerke-recipes.download.MySQLWorkbench</string>
    <key>Description</key>
    <string>Builds MySQLWorkbench and imports into a Munki repo.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.cgerke-recipes.munki.MySQLWorkbench</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MySQLWorkbench</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>MySQL Workbench is a unified visual tool for database architects, developers, and DBAs.</string>
            <key>display_name</key>
            <string>MySQLWorkbench</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installs</key>
                    <array>
                        <dict>
                            <key>CFBundleIdentifier</key>
                            <string>com.oracle.mysql.workbench</string>
                            <key>CFBundleName</key>
                            <string>MySQLWorkbench</string>
                            <key>path</key>
                            <string>/Applications/MySQLWorkbench.app</string>
                            <key>type</key>
                            <string>file</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
          <key>Arguments</key>
          <dict>
            <key>pkg_path</key>
            <string>%pathname%</string>
            <key>repo_subdirectory</key>
            <string>%MUNKI_REPO_SUBDIR%</string>
          </dict>
        </dict>
    </array>
</dict>
</plist>
