<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of OpenOffice.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.cgerke-recipes.download.OpenOffice</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenOffice</string>
		<key>LANGUAGE</key>
		<string>en-US</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>First determine the latest version</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://sourceforge.net/projects/openofficeorg.mirror/rss?limit=1</string>
				<key>re_pattern</key>
				<string>http://sourceforge.net/projects/openofficeorg.mirror/files/(?P&lt;version&gt;[0-9\.]+)/binaries</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Now use the latest version to request links to a specific language</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://sourceforge.net/projects/openofficeorg.mirror/rss?path=/%version%/binaries/%LANGUAGE%</string>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;http://.*/%version%/binaries/%LANGUAGE%/.*_MacOS_x86-64_install_%LANGUAGE%\.dmg/download)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
