<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.cgerke-recipes.download.PIP</string>
	<key>Description</key>
	<string>Creates a pkg to deploy PIP</string>
	<key>Identifier</key>
	<string>com.github.autopkg.cgerke-recipes.pkg.PIP</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PIP</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Root</string>
                <key>pkgdirs</key>
                <dict>
                    <key>tmp</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
		<dict>
			<key>Comment</key>
			<string>Copy resources.</string>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/get-pip.py</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Root/tmp/get-pip.py</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Create a PackageInfo file using the template.</string>
			<key>Processor</key>
			<string>PkgInfoCreator</string>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>0.1</string>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Root</string>
				<key>template_path</key>
				<string>%RECIPE_DIR%/%NAME%/PackageInfoTemplate</string>
				<key>infofile</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
				<key>pkgtype</key>
				<string>flat</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Build the package.</string>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
                <key>force_pkg_build</key>
                <string>true</string>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>tmp</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
					</array>
					<key>id</key>
					<string>com.github.autopkg.cgerke-recipes.%NAME%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>resources</key>
					<string>%RECIPE_DIR%/%NAME%/Resources</string>
					<key>scripts</key>
					<string>%RECIPE_DIR%/%NAME%/Scripts</string>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
