<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.Silverlight</string>
	<key>Description</key>
	<string>Downloads the latest Silverlight version and creates a cmmac package for deploying via Microsoft SCCM.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.cgerke-recipes.sccm.Silverlight</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Silverlight</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>The cgerke-recipes repository is deprecated.
Details: https://github.com/autopkg/cgerke-recipes/issues/37

Some recipes from the repo will be moved to the homebysix-recipes repo. However, 
SCCM type recipes are not part of that plan. If you are interested in 
maintaining one or more SCCM recipes from the cgerke-recipes repo, please 
leave a comment on the issue linked above.
				</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Create a cmmac file for SCCM using a shared processor.</string>
			<key>Processor</key>
			<string>com.github.autopkg.cgerke-recipes.SharedProcessors/CmmacCreator</string>
			<key>Arguments</key>
			<dict>
				<key>source_file</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>destination_directory</key>
				<string>%RECIPE_CACHE_DIR%</string>
			</dict>
			<key>SharedProcessorRepoURL</key>
			<string>https://github.com/autopkg/cgerke-recipes</string>
		</dict>
	</array>
</dict>
</plist>
