<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest stable version of Wireshark.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.cgerke-recipes.download.Wireshark</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Wireshark</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The cgerke-recipes repository is deprecated.
Details: https://github.com/autopkg/cgerke-recipes/issues/37

Copies of these recipes have been created in the homebysix-recipes repo:
- Wireshark.download
- Wireshark.install
- Wireshark.munki
- Wireshark.pkg
- WiresharkDev.install
- WiresharkDev.munki

These recipes are deprecated and will soon be removed:
- Wireshark.sccm
- WiresharkDev.sccm

If you are interested in adopting the deprecated recipes, comment on
the issue linked above.
                </string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.wireshark.org/download.html</string>
                <key>request_headers</key>
                <dict>
                    <key>User-Agent</key>
                    <string>Safari 8.0.2</string>
                </dict>
                <key>re_pattern</key>
                <string>(Wireshark([%]20)*.*([%]20)*Intel([%]20)*64.dmg)</string>
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.wireshark.org/download/osx/%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Wireshark*.app</string>
				<key>requirement</key>
				<string>anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7Z6EMTD2C6"</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>
