<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
	<string>com.github.scriptingosx.pkg.XQuartz</string>
	<key>Description</key>
	<string>Downloads and installs the current release version of XQuartz.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.cgerke-recipes.install.XQuartz</string>
	<key>Input</key>
	<dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>The cgerke-recipes repository is deprecated and will be removed soon.
Details: https://github.com/autopkg/cgerke-recipes/issues/37
				</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
