<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.cgerke-recipes.EnableRemoteManagement</string>
	<key>Description</key>
	<string>Create a cmmac package. Create a package with a payload. Includes a LaunchAgent to enable and configure
remote management for Apple Remote Desktop and VNC after every reboot. Refer to the recipe launchdaemon to customise
the configuration to suit your needs and the preference to set your VNC passwrod. In my example I setup Remote Desktop
to require the end user to accept an incoming connection. You may for example want to the change the allUsers option to
limit connections to admin users only or even a specific user. This package can also set your VNC password, but
right now you will need to manually add your HASH to the com.apple.VNCSettings.txt preference as I have not yet
added a processor to do it for you. Still thinking about how to implement that in a nice way because this
type of config is very subjective, maybe just leave this as an example for people.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.cgerke-recipes.sccm.EnableRemoteManagement</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EnableRemoteManagement</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Create a cmmac file for SCCM using a shared processor.</string>
			<key>Processor</key>
			<string>com.github.autopkg.cgerke-recipes.SharedProcessors/CmmacCreator</string>
			<key>Arguments</key>
			<dict>
				<key>source_file</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>destination_directory</key>
				<string>%RECIPE_CACHE_DIR%</string>
			</dict>
			<key>SharedProcessorRepoURL</key>
			<string>https://github.com/autopkg/cgerke-recipes</string>
		</dict>
	</array>
</dict>
</plist>
