<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Create a package. Includes a LaunchDaemon to ensure ssh remote login is enabled after every reboot.
		Also configures a default motd terminal banner via /etc/motd</string>
	<key>Identifier</key>
	<string>com.github.autopkg.cgerke-recipes.EnableRemoteLogin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EnableRemoteLogin</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Create a root.</string>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>pkgdirs</key>
				<dict>
					<key>Library</key>
					<string>0755</string>
					<key>Library/LaunchDaemons</key>
					<string>0755</string>
					<key>etc</key>
					<string>0755</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Copy motd to /etc/motd</string>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_DIR%/%NAME%/Root/etc/motd</string>
				<key>destination_path</key>
				<string>%pkgroot%/etc/motd</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Copy com.github.autopkg.cgerke-recipes.ssh.plist to /Library/LaunchDameons/com.github.autopkg.cgerke-recipes.ssh.plist</string>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_DIR%/%NAME%/Root/Library/LaunchDaemons/com.github.autopkg.cgerke-recipes.ssh.plist</string>
				<key>destination_path</key>
				<string>%pkgroot%/Library/LaunchDaemons/com.github.autopkg.cgerke-recipes.ssh.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Create a PackageInfo file using the template.</string>
			<key>Processor</key>
			<string>PkgInfoCreator</string>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>0.1</string>
				<key>template_path</key>
				<string>%RECIPE_DIR%/%NAME%/PackageInfo</string>
				<key>infofile</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
				<key>pkgtype</key>
				<string>flat</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Build the package.</string>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgname</key>
				<string>%NAME%</string>
				<key>pkg_request</key>
				<dict>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>id</key>
					<string>com.github.autopkg.cgerke-recipes.%NAME%</string>
					<key>infofile</key>
					<string>%RECIPE_DIR%/%NAME%/PackageInfo</string>
					<key>resources</key>
					<string>%RECIPE_DIR%/%NAME%/Resources</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>scripts</key>
					<string>%RECIPE_DIR%/%NAME%/Scripts</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Library/LaunchDaemons</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
						<dict>
							<key>path</key>
							<string>Library</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
