<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Create a package. Firstboot script example. This script sets the hostname etc to match the ethernet Mac
address (without the colons). This type of script is very subjective so it serves as an example at the moment.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.cgerke-recipes.pkg.ThinImaging_Firstboot</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Firstboot</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Create a PackageInfo file using the template.</string>
			<key>Processor</key>
			<string>PkgInfoCreator</string>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>0.1</string>
				<key>pkgroot</key>
				<string>%RECIPE_DIR%/%NAME%/Root</string>
				<key>template_path</key>
				<string>%RECIPE_DIR%/%NAME%/PackageInfoTemplate</string>
				<key>infofile</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
				<key>pkgtype</key>
				<string>flat</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Build the package.</string>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
                <key>force_pkg_build</key>
                <string>true</string>
				<key>pkgname</key>
				<string>%NAME%</string>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>usr</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
						<dict>
							<key>path</key>
							<string>usr/local</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
						<dict>
							<key>path</key>
							<string>usr/local/bin</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
					</array>
					<key>id</key>
					<string>com.github.autopkg.cgerke-recipes.%NAME%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>resources</key>
					<string>%RECIPE_DIR%/%NAME%/Resources</string>
					<key>scripts</key>
					<string>%RECIPE_DIR%/%NAME%/Scripts</string>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
