<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.cgerke-recipes.pkg.ConfigRegistrationWizard</string>
	<key>Description</key>
	<string>Creates a payload free distribution pkg to disable the Apple registration wizard.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.cgerke-recipes.mpkg.ConfigRegistrationWizard</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ConfigRegistrationWizard</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Copy resources.</string>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_DIR%/%NAME%/Resources</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Resources</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Create distribution file.</string>
			<key>Processor</key>
			<string>com.github.autopkg.cgerke-recipes.SharedProcessors/PkgDistributionInfoCreator</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>distribution_file</key>
				<string>%RECIPE_CACHE_DIR%/Resources/distribution.xml</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Create a distribution pkg using a shared processor.</string>
			<key>Processor</key>
			<string>com.github.autopkg.cgerke-recipes.SharedProcessors/PkgDistributionCreator</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/</string>
				<key>destination_file</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.mpkg</string>
				<key>distribution_file</key>
				<string>%RECIPE_CACHE_DIR%/Resources/distribution.xml</string>
				<key>resources_path</key>
				<string>%RECIPE_CACHE_DIR%/Resources</string>
			</dict>
			<key>SharedProcessorRepoURL</key>
			<string>https://github.com/autopkg/cgerke-recipes</string>
		</dict>
	</array>
</dict>
</plist>
