<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the Konica Minolta 554e Printer Drivers.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.cgerke-recipes.download.KonicaMinolta554e</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KonicaMinolta554e</string>
                <key>USER_AGENT</key>
				<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
	</dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.konicaminolta.com.au/custom/konicaminolta/kmmedia/Files/PrintDriver/554e_Series__Mac_OS_v5-2-0_A4.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.konicaminolta.com.au/custom/konicaminolta/kmmedia/Files/PrintDriver/554e_Series_MacOS_v4-x-x.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
