<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.cgerke-recipes.pkg.GoogleDrive</string>
	<key>Description</key>
	<string>Downloads the latest Google Drive version and creates a cmmac package for deploying via Microsoft SCCM.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.cgerke-recipes.sccm.GoogleDrive</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GoogleDrive</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Create a cmmac file for SCCM using a shared processor.</string>
			<key>Processor</key>
			<string>com.github.autopkg.cgerke-recipes.SharedProcessors/CmmacCreator</string>
			<key>Arguments</key>
			<dict>
				<key>source_file</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>destination_directory</key>
				<string>%RECIPE_CACHE_DIR%</string>
			</dict>
			<key>SharedProcessorRepoURL</key>
			<string>https://github.com/autopkg/cgerke-recipes</string>
		</dict>
	</array>
</dict>
</plist>
