<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MySQLWorkBench.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.cgerke-recipes.download.MySQLWorkBench</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MySQLWorkBench</string>
                <key>USER_AGENT</key>
				<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
	</dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://dev.mysql.com/downloads/workbench</string>
                <key>re_pattern</key>
                <string>(?P&lt;dmg&gt;mysql-workbench-community-\S+dmg)</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://dev.mysql.com/get/Downloads/MySQLGUITools/%dmg%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
