<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
	<string>com.github.cgerke.pkg.MySQLWorkBench</string>
	<key>Description</key>
	<string>Downloads the latest MySQLWorkBench version and creates a cmmac package for deploying via Microsoft SCCM.</string>
	<key>Identifier</key>
	<string>com.github.cgerke.sccm.MySQLWorkBench</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MySQLWorkBench</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Create a cmmac file for SCCM.</string>
			<key>Processor</key>
			<string>cmmacCreator</string>
			<key>Arguments</key>
			<dict>
				<key>source_file</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>destination_directory</key>
				<string>%RECIPE_CACHE_DIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
