<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version MySQLWorkBench.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.cgerke-recipes.download.MySQLWorkBench</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MySQLWorkBench</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://dev.mysql.com/downloads/file.php?id=452671</string>
                <key>re_pattern</key>
                <string>(?P&lt;dmg&gt;mysql-workbench-community-6.1.7-osx-i686.*\.dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://dev.mysql.com/get/Downloads/MySQLGUITools/%dmg%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
